# Файл для хранения константных значений

# --------------------------------------

class Mode:
    DEBUG = "debug"
    RELEASE = "release"
    TEST = "test"

# --------------------------------------

class LogLevel:
    DEBUG = "Debug"
    INFO = "Info"

# --------------------------------------

# Относительный путь к json файлу с настройками
SETTINGS_FILE = './settings.json'

# --------------------------------------

# Путь к датасету со сварочными швами
DATASET_DIR = './WeldDataset'

# --------------------------------------